{"type":"data","nodes":[null,{"type":"data","data":[{"title":1,"date":2,"body":3},"Year in Review: 2024","December 31, 2024","They say the years grow shorter as you grow older, but 2024 has undoubtedly been the longest year of my life thus far.\n\n## Milestones\nAfter 4.5 arduous years, I finally graduated college in December. I'm grateful to be still graduating in my expected year despite taking three semesters of leave.\n\n## Adventures\nI visited three new countries this year:\n1. Japan, where I climbed Mt. Fuji\n2. Cambodia, where I spent Christmas in Angkor Wat\n3. Vietnam, where I explored Hanoi\n\nI drove a UHaul van for the first time. It was also my first time driving since January 2021.\nI then went on a 7 day roadtrip spanning 4 US states and two Canadian provinces. No cars were (seriously) damaged in the process.\nI visited...\nA new national park:\n- Crater Lake National Park\nA new state park:\n- Silver Falls State Park\nA new favorite restaurant:\n- Local Tide\nAnd saw...\nMy first theatre performance:\n- Much Ado About Nothing\n\n\nI saw more of Pittsburgh than I ever did in my last 3 years combined and it finally started to grow on me.\n\n## Music and Art\nI listened to 2679 songs on Spotify this year.\nBy far my favorite album of this year was Imaginal Disk by Magdalena Bay.\nMy favorite single was Charli XCX's Talk talk with Troye Sivan from the brat remix.\nHere's a list of my favorite songs released this year.\n- 3:AM(feat. Erykah Badu) - Rapsody\n- BIRDS OF A FEATHER - Billie Eilish\n- Birth4000 - Floating Points\n- Breathe - Yeat\n- Echo - The Marias\n- Eusexua - FKA twigs\n- Living is Easy - Agriculture\n- luther (with sza) - Kendrick Lamar\n- May Ninth - Khruangbin\n- Moon Girl - Ha Vay\n- Nothing to Declare - MGMT\n- Pensamientos Intrusivos - Kali Uchis\n- places to be - Fred again..., Anderson .Paak, CHIKA\n- Rah Tah Tah - Tyler, The Creator\n- Sadness As A Gift - Adrianne Lenker\n- Soup - Remi Wolf\n- Strawberry - Roy Blair\n- Take What's Given - BADBADNOTGOOD\n- The Magician - Geordie Greep\n- The Ballad of Matt & Mica - Magdalena Bay\n- The Feminine Urge - Preluede to Ecstasy\n- The Thief - Future Islands\n- U DON'T KNOW ME LIKE THAT - Quadeca\n- Woo - James Blake, Lil Yachty\n\nI visited 4 new art museums this year:\n1. The Vancouver Art Gallery\n2. Tokyo National Museum\n3. SF MOMA\n4. Carnegie Museum of Art (embarassingly late)\n\nOf these, my favorite exhibit was [Denyse Thomasos: just beyond](https://www.vanartgallery.bc.ca/exhibitions/denysethomasos)\n\nI watched six movies, my favorite of which was DiDi.\n\nI watched two tv shows: Severance and Arcane S2, which is the most television I've watched in a year.\n\n\nI read The Song of Solomon by Toni Morrison and Pachinko by Min Jin Lee. \nMy biggest bottleneck this year was trying to get through War and Peace. I tried many times but could not get invested in the characters and only made it half-way through.\n\n\n\n\n\n## Fitness\n\nI skiied for the first time since COVID at Whistler Blackcomb.\nI went bowling for the first time since middle school.\nI tried to run once a week and ran my first-ever race: the YMCA Dallas Turkey Trot, finishing with a 1:12:46 time.\nI went rock-climbing with friends sporadically, totalling 4 trips.\n\n\nThat's a wrap for 2024. On to the next >>"],"uses":{"params":["slug"]}}]}
